# TopographyEditScope Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TopographyEditScope Properties
TopographyEditScope Class See Also
---
The TopographyEditScope type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.  (Inherited from EditScope.) |
| IsPermitted | Tells if the edit scope is permitted to start.  (Inherited from EditScope.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from EditScope.) |

# See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace